tap "a2-ai/tap"
tap "homebrew/core"
# Fast and opinionated formatter for R code
brew "air"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Command-line interface for SQLite
brew "sqlite"
# Next-gen compiler infrastructure
brew "llvm"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Deduplicating archiver with compression and authenticated encryption
brew "borgbackup"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Vector graphics library with cross-device output support
brew "cairo"
# CLI for Cloudflare API v4
brew "cloudflare-cli4"
# Cross-platform make
brew "cmake"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# GNU Emacs text editor
brew "emacs", restart_service: :changed
# Modern, maintained replacement for ls
brew "eza"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU compiler collection
brew "gcc"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Optimized BLAS library
brew "openblas"
# Geospatial Data Abstraction Library
brew "gdal"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Create and edit releases on Github (and upload artifacts)
brew "github-release"
# Lightweight and flexible command-line JSON processor
brew "jq"
# LLVM's OpenMP runtime library
brew "libomp"
# LLVM Project Linker
brew "lld"
# Mac App Store command-line interface
brew "mas"
# Hash utilities
brew "md5sha1sum"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# OCaml package manager
brew "opam"
# Software environment for statistical computing
brew "r"
# Safe, concurrent, practical language
brew "rust"
# Markup-based typesetting system
brew "typst"
# Unidata unit conversion library
brew "udunits"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# General-purpose lossless data-compression library
brew "zlib", link: true
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# rv - a fast R package installer
brew "a2-ai/tap/rv"
# Command-line helper for the 1Password password manager
cask "1password-cli@beta"
# Password manager
cask "1password@beta"
# Image editing and design software
cask "affinity"
# Application uninstaller
cask "appcleaner"
# Display management tool
cask "betterdisplay"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Free app that makes your Internet safer
cask "cloudflare-warp@beta"
# Voice and text chat software
cask "discord"
# Monitor resolution and settings manager
cask "displaybuddy"
# Web browser
cask "firefox"
cask "font-fontawesome"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github"
# Client for the Google Drive storage service
cask "google-drive"
# Keyboard customiser
cask "karabiner-elements"
# Software for Logitech devices
cask "logi-options+"
# Support for Logitech G gear
cask "logitech-g-hub"
# VPN client
cask "mullvad-vpn@beta"
# Free and open-source RSS reader
cask "netnewswire"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx@beta"
# Colour picker for colours onscreen
cask "pika"
# Data science IDE
cask "positron"
# Scientific and technical publishing system built on Pandoc
cask "quarto"
# All-in-one bookmark manager
cask "raindropio"
# Data science software focusing on R and Python
cask "rstudio"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Web browser focusing on security
cask "tor-browser"
# Keyboard configurator
cask "via"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Native desktop client for WhatsApp
cask "whatsapp"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Application for generating TOTP and HOTP codes
cask "yubico-authenticator"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "HP", id: 1474276998
mas "Kagi for Safari", id: 1622835804
mas "Save to Raindrop.io", id: 1549370672
mas "Teleparty For Safari", id: 6471985961
mas "uBlock Origin Lite", id: 6745342698
vscode "1password.op-vscode"
vscode "alefragnani.project-manager"
vscode "anthropic.claude-code"
vscode "ocamllabs.ocaml-platform"
