tap "a2-ai/tap"
tap "borgbackup/tap"
tap "oven-sh/bun"
# Fast and opinionated formatter for R code
brew "air"
# General-purpose data compression with high compression ratio
brew "xz"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Next-gen compiler infrastructure
brew "llvm"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Vector graphics library with cross-device output support
brew "cairo"
# Cross-platform make
brew "cmake"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# GNU Emacs text editor
brew "emacs", restart_service: :changed
# Modern, maintained replacement for ls
brew "eza"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# Command-line fuzzy finder written in Go
brew "fzf"
# Replace zsh completion selection menu with fzf
brew "fzf-tab"
# GNU compiler collection
brew "gcc"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Cartographic Projections Library
brew "proj"
# LLVM's OpenMP runtime library
brew "libomp"
# Geospatial Data Abstraction Library
brew "gdal"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Fast and flexible C++ library for working with OpenStreetMap data
brew "libosmium"
# LLVM Project Linker
brew "lld"
# Powerful, lightweight programming language
brew "lua"
# Hash utilities
brew "md5sha1sum", link: true
# Minimal CLI coding agent
brew "mistral-vibe"
# General purpose programming language in the ML family
brew "ocaml"
# OCaml package manager
brew "opam"
# Development kit for the Java programming language
brew "openjdk"
# Libosmium-based command-line tool for processing OpenStreetMap data
brew "osmium-tool"
# Tool for managing OCI containers and pods
brew "podman"
# Tool Command Language
brew "tcl-tk"
# Software environment for statistical computing
brew "r"
# Official tldr client written in Rust
brew "tlrc"
# Extremely fast Python type checker, written in Rust
brew "ty"
# Markup-based typesetting system
brew "typst"
# Unidata unit conversion library
brew "udunits"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# General-purpose lossless data-compression library
brew "zlib", link: true
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# rv - a fast R package installer
brew "a2-ai/tap/rv"
# Deduplicating archiver with compression and authenticated encryption
brew "borgbackup/tap/borgbackup-fuse"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Local-first and end-to-end encrypted notes app
cask "anytype"
# Application uninstaller
cask "appcleaner"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
# Server and cloud storage browser
cask "cyberduck"
# Voice and text chat software
cask "discord"
# Launcher for *Epic Games* games
cask "epic-games"
# Web browser
cask "firefox"
cask "font-fontawesome"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Keyboard customiser
cask "karabiner-elements"
# App to manage software development and track bugs
cask "linear-linear"
# Software for Logitech devices
cask "logi-options+"
# Support for Logitech G gear
cask "logitech-g-hub"
# File system integration
cask "macfuse"
# Free and open-source RSS reader
cask "netnewswire"
# Podcast platform
cask "pocket-casts"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Data science IDE
cask "positron"
# Scientific and technical publishing system built on Pandoc
cask "quarto"
# All-in-one bookmark manager
cask "raindropio"
# Control your tools with a few keystrokes
cask "raycast"
# Music streaming service
cask "spotify"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Native desktop client for WhatsApp
cask "whatsapp"
# Application for generating TOTP and HOTP codes
cask "yubico-authenticator"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organise, cite, and share research sources
cask "zotero"
