tap "a2-ai/tap"
tap "borgbackup/tap"
tap "homebrew/core"
# Fast and opinionated formatter for R code
brew "air"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Command-line interface for SQLite
brew "sqlite"
# Next-gen compiler infrastructure
brew "llvm"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Vector graphics library with cross-device output support
brew "cairo"
# Cross-platform make
brew "cmake"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# GNU Emacs text editor
brew "emacs", restart_service: :changed
# Modern, maintained replacement for ls
brew "eza"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU compiler collection
brew "gcc"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Geospatial Data Abstraction Library
brew "gdal"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Lightweight and flexible command-line JSON processor
brew "jq"
# LLVM's OpenMP runtime library
brew "libomp"
# LLVM Project Linker
brew "lld"
# Mac App Store command-line interface
brew "mas"
# Hash utilities
brew "md5sha1sum"
# OCaml package manager
brew "opam"
# Software environment for statistical computing
brew "r"
# Markup-based typesetting system
brew "typst"
# Unidata unit conversion library
brew "udunits"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# General-purpose lossless data-compression library
brew "zlib", link: true
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# rv - a fast R package installer
brew "a2-ai/tap/rv"
# Deduplicating archiver with compression and authenticated encryption
brew "borgbackup/tap/borgbackup-fuse"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Application uninstaller
cask "appcleaner"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
cask "font-fontawesome"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github@beta"
# Keyboard customiser
cask "karabiner-elements"
# Software for Logitech devices
cask "logi-options+"
# File system integration
cask "macfuse"
# Free and open-source RSS reader
cask "netnewswire"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx@beta"
# Colour picker for colours onscreen
cask "pika"
# Data science IDE
cask "positron"
# Client for Proton Drive
cask "proton-drive"
# Scientific and technical publishing system built on Pandoc
cask "quarto"
# All-in-one bookmark manager
cask "raindropio"
# Control your tools with a few keystrokes
cask "raycast"
# Music streaming service
cask "spotify"
# Native desktop client for WhatsApp
cask "whatsapp"
# Application for generating TOTP and HOTP codes
cask "yubico-authenticator"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "HP", id: 1474276998
mas "Kagi for Safari", id: 1622835804
mas "Save to Raindrop.io", id: 1549370672
mas "Teleparty For Safari", id: 6471985961
mas "uBlock Origin Lite", id: 6745342698
